#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "49978908e7c4364e580dd37af83d5181" -> "321c05e94bd554368b4f7a8bb2772ae0"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "054a88b0d263dd02626a8676a8039abd" -> "4db05da9d877396f2a646b7813638019"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "6bfb6bf716cf80c3dd61f104231049ee" -> "d9f037cce95875bbef741063065b5f33"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d625b5c257d75e28e9ab69d87fcc0f07" -> "f3ee1f2b4bffc73a000e0d9bfd71aced"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "28158ecad87bcdf2071c69aa2c8e9f13" -> "7725dced02cb9f9b87d54eb4f2e90dae"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "b173331fc19bd14e36481bd110ec1222" -> "4997a57e1e68a7d83df69def3f063c77"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "1a0ecdf7b71337268ee6bd352d0965f0" -> "a1ffc94f9e44a8d468a19ccc27352ffb"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "064daf03a7d617eeb98078d5f3a219df" -> "94845ef6646b49d810f5cf8e7b8344cd"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "082886d91dd2164163d0206b5b9cc20b" -> "1868e197c4469d4e9393678b1e6b0088"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "aa9a3c3245207c14cb5be666ce9950d3" -> "d7d0d2f86d730aa9eb2c247b1f12782e"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "e11423f755b5190a8c875539ff3f9208" -> "e221f1cb8f680db65cf20b515e4fe99f"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "de6d287628c8381d43ceba60d2b1ea02" -> "26acf127eeb73caf0ab39cd991c3b1b5"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "67110c33d998a8d32578d4e44e8273cc" -> "9da05384b902bb518d276b6f33bfeec3"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "740b600363ed80c46301fea92149fde0" -> "47ef86b60887bdd90877362360056978"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "1e1aff9e42d64bf37484a2835a4a28cf" -> "d7f4674b318ecc07a596463491feb87d"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "77762a290f44ecf7a9bff749a0197356" -> "cb51d0404b41b063da197934e25ad0dc"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e0d2350b480c9f2e49d013e3ee4f3483" -> "1d218d18b115886b0afe10e3ecd2ea05"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "5e289b854b8ae4c9bc88e07d8efd895c" -> "02a48c5546d70730135fec5d16af0f50"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "acd22d8b10dc2629cff3ac0b145f85a6" -> "9c56929282da0b562283a688843d8391"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "5044f2ddf99a1f58f60b7b2e5044b07f" -> "33893de6cfd0eb0629aca5abea690ebe"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "f399f3ec7c9f86082f221cfc51d78f02" -> "34c56804ab4c74ebf75b7e822731361d"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "53fb5af303c7555d37af81baa1e77719" -> "962fe5e035635bcaa7b74a12ce0bb7bf"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "dd0301ac1f7be65e2a22ccaabe2769fc" -> "fce2cfcc36e3d5ce80e59d9e832f8382"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "effac2b751a22bd2d98af05073197cc1" -> "bebc14063c08182e0024ae427c247896"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "8ea237401d3e201996cd2934acf6689b" -> "52e93c948fe7016ac25b5692c41097ce"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "3b76466691b2bebd8c4347d74f39a74e" -> "beb210796f146f057f318d8e1a89909e"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "f2c91ab053701a15b21056cb5def442c" -> "b1f55ce66152c93576fdf4785a48419c"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "b2ef4a8b899c4df6066fa4e10c4fe49f" -> "b6f427ec5c941746f9a23a9ec0f05cb3"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "7658352201ffbf6afbfc6f44f0a3e83d" -> "16fe04d64c4ed503694ed24b1d56cc54"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "4f1e11549163dfc49ae8d403032f3458" -> "d20456d43c54e4396ff89e3a438d107c"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e2fb7229cc789166e5832dfca4473915" -> "1e23b52e2d52117e557bd8a1509e36fe"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ea57270fefbc31f295de9c5f2f19478d" -> "c219e64b7e1e283d1a47a0327ad88b09"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "e6a546f3a64cf1b8a5663eb5423ac6ce" -> "ff8ffd8de2440d11307bb269400b0c11"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "626de23d4632ab80b007e6dcb9bc10ab" -> "c9e8e72c0b1cdb1f24576f51f9b15cd2"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7f77ca41d8b24a5932853e5aa1d45c3d" -> "9f5f04b48a4119fa945d294b75940a07"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "972a6a938dd7cbe4bf5e1b3f541c6bb9" -> "f1c62541f2ff4197d99fe657f1b08bd4"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "cad73ba83e9a69389886f66c585d5aea" -> "37ce4abe116e971457236ae8a5f11a46"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "fb3b34e72d12a643733f33ae12f3444c" -> "ff1285c83592bd7bc2e0704e0b107eff"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "63adc3dfcbbb8d80e3c5ca9cced34179" -> "3fe4a3bbc3549db23cd70c25e9f42e7e"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "cc83de0fa4bebf831cf4a4ae467282d4" -> "16dd3fc85be2d805ede525243fe38234"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "2d630ef4063fa3d73a18502e29850cd5" -> "8997eba7fc1e5ce3070bc41a68ed76be"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "cab697472f30fc827ca1996e3a415880" -> "0e6311b4c16c12633bca382c14b5fdac"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "ee892eca0a622d9c865a63bd204ab307" -> "9b399e07dff47026d1dda44e99451832"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "84902a6e09f5f1d9cf9d1dc517e8a157" -> "cf84a6c31fcdbd530b75f50d448ee491"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "3616fb2b9669bcf3fbf461f08e48ec1f" -> "58fc4d7429d6945b52412872e46ff3f1"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "528f10818b49539a944476d01e4c54d0" -> "90e54e355100445bed1e53567f2a1833"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "e2b3511b39a74c5c70ae19a1fda0ac34" -> "990e3c678b73c4e0cd6b61e4a91dbce9"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "I7vo+jTRb6BCbKMUiyTK+DuFs9zxgWfGrbad79hzuRE=" -> "ATlrBKFdi798eRfOD+HXqou+FlNPgliHgY+AayYzf1w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "AbjR8/5hiWNs6PVWzYVJhbNZYf2rshrMOHm/RY+jiko=" -> "oPx+GbTN+xopvhin0ZVP4cI36byBVL9eVJ+mZh6jgrM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "ogbTPZS4lEQ+7wTuvf+Uvhl8Ol78+ntCbYWRXHWA7h8=" -> "ZWCMdovBJ2qtC4LkOOC/iVP1OBs9B1XEvpuq/Lgv/jA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "yFf89J3AhTHCmlvZHnUj2Q8NSBr5aWUlLyoR6PkazuU=" -> "Ek74TRipCYGhEaOPUQCU/UfAvp6EgCW/urxs3mxY/ow="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "3hrVyF67Vd8LktP9WXlhjATkdEPKfgRRoxBnj9MxRKk=" -> "+7Ivr+0cMeUkMh3IqToQqGyMr1Ez760dj7RoSsCFnSQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "RDOQjHXM0AaOTBGPKwBlxgtG7SetR3P8LAmWx2D4sLA=" -> "8UCv5oCCh1zoLrVcxH2j3gJIBgtWzl87ZNXh2Ug7A9s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "F+Qb0efzVtk32umzT+X5IfcoayqGDhxxYCFL9eqYC0s=" -> "zg7gW9KCVdw+kruqznLtmuHd218CrRt3Q+hglj/QFB4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "KNMQfz0DRyjNfvO2NKsXVDfYguqnawjNK8OQB+ZH9kQ=" -> "DZgGspUZwQn7O7Ver4dA+UsSKObHp8Ghud8Gm9KTYVs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "uebFC8Y4/K7eFFUd/zW48S2U6hYnKTVBQY6e4YtVr1M=" -> "Cah41bHs9VJpA9wApd04HUOWkU6ovOZ0D2LIDYQue1E="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "oijQS2GWzk/Jqz9WUnfAYLAqC8H77t3TiWrvxDKXysI=" -> "33W/MZtCwSShFsOwU5EKWF5N2XTeH17s70HujuWcemU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "zWINWU1K8P9ZcfdZ9L4kAWAGs+mkvSAPXTKx/9vwuoY=" -> "Sp6KSbZsSHUNKGHmoxXBRNJXOggYmt3P/25exGWV8Ts="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "r9embf8SeSPTLEGxbxfv9FZ2Wnxbf4T9xy3GxMpPjFs=" -> "56XjyVMzcWaSjG/NapmoCQ1vW93i/VGl6Jg59Az235s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "0h7UqGBMOAn40vZRwrVWYvFdcilGWPaBh4+ZmX08Pls=" -> "6VHuagfgakTa9JniJt2JD9bQf/rR0gp/AFsn+fClUA4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "usxalsFxE2EJa6ZGxLXdbifnFuYDd+fBTNzxRU5EVpE=" -> "spYm4zKkkWmqJjKkyoqy9zj9i32qU9KUsAML+rStpRc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "xxqKDCGNE4FS6e6YfAO73dlwKMeqaIbmrXNLc6utRYw=" -> "ztYK4qvi3yrfDnYqjJyfilTiSWmdm6lWHwwx6zrk2hA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "8S2/G9/nCjy5xbLwvOe53gX74hfySHOuSnEJRQWfelI=" -> "fEGKmEdo8uevi4HN1JwrUwXZacvC/Z4++3vynKoYoSw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgLfBUXRiw6Z9snqc3rVgIAqVZbbLaiye7bvT3TVsf8=" -> "r406c2+NKWXUx0ZcEKGeNVL1O+3eJdCjW3WeqajmKuU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "vdmF9SNMwepfX3WbpZHqfJIlKNncpi9/8aDVYZci8Ng=" -> "nbhifFQpmZys01GTfInZkj7zDuqkqgxQvy5vDX7eZv4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q7ovP7QW+FZNeUOXENZEc2hlah2LMXrREwkpniwy17E=" -> "YZpKzEllSJQNqq6OVtWO2TLqjv/jcbSd0gmKfE5kOt8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "/fj2hupGCYPggRAHam7fOlB8NhAgBHs3nYHb/rFThBg=" -> "4la2XDfJBQ2RuEbbWRAa+0Q71PrC1B2Jnfthn59VnjY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "YJEmcJtirN+DFDKmfCrdLluS2G7wADCNvC3sGtMF78Q=" -> "mxdFATVidURbEAbg09wzJaZQd55gYoxbHVCNT6MB+ss="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "FR+4PNL1cdoahVEDbbKNYggPBPJVF+FuZ/vWiX1wXUs=" -> "hNSbPUsOcycbnvsjSCSV8uKBGBSq0lcEfQ1oDu4/XF0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "AzcGwYTqYaYK7J1SH6IGQ3rD7FnxRsAAgcEuyRkvgI0=" -> "ItfuooyWyXOMaE+tl7WBSqfagOsP+YWhYc2MZNSQ5ss="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "yODY9zTLRxFH9/SZG/eed8IshboWD/pK0r/Nsj4rXCw=" -> "sgYSSEHMYd4mbF6MhyUe6fuUbPqo9mgB8uWbgMAu1qE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "UV8NuV5j9GE/yz2aMTwIwyWinCIBLCbRDjExUsNkx70=" -> "HGXRGlYx1nSmBNgcQoIrLNk3SHZTWyHkS+0yZQnYZKc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "y2N05WJwh2zaGyxb/8JJHubRAQvCmWpny5NrKT84T54=" -> "OguBj3oZJpbzVE50e3CyY6NPOk3ZakawFDNWQFLIKt8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "1Hde0chkVPzhGUTdW7OIfzM77rBB4ZAjab5i2xJZuVI=" -> "LNNoP2GvgmcAdfZzsAyHCngoUzC3TWBncZFqEgWEYkc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "znH14WJuN5LSCJ+kACI+6nr0ebcIeVF9IptEn4Fxs5c=" -> "lE1s3FAWNk8zEXxnOGd/FVooS6XZ3+fywCzIu5FbyKs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "E3T7H9+zyHVlc7Qo9FVzRJfLB4t0wkMM9yKeiJlgoJE=" -> "kCRbx7QHT2KXdKO/gxbM+GpPcgZ3BZfKkPIC7nMWrMg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "G5NvU0N9zNfuHpRjsZcOlJME+ZKjQonL9aanGqlX8tE=" -> "5dkGnJ5kE1MxKp6TVwdJDfxjwMj/0dqrif7kfs2nFsE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-14T22:49:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhxjd6BAFCTXVZT6ChlOhyDCtLPuPcI1SIDewxFYdps=" -> "CYzBDCYvbH+8u2Hguky+6bbnm4pvFX+AAInY3pNQ/Gc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "Prtn8+O/GqRk7XHgXMR/YXqMv+3brI9ZZ1VU1dAweaI=" -> "ox4vVoPJYvrOkTcCvcVgru21Ac5j1vvsBevRQW+a4X8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "z3hTUThwvxGgCV674FEs+qKK+lbDiEjqF6rJgr1scXQ=" -> "2w8z6AVVyjdZ3rFvY6kmsVZ3a/NQ+8U5oIiQ9TjOKhw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "6u5B3O1/muZLul8YsXeDFRcG+9ipyWXf6x58d9GGD/0=" -> "70dvVmvCM46bEMNEWFNLxx007464X8scGZZ8OS8k8Os="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "SENwF1tJx2hGshJ8+RBm/Y9qTIifxQOh/xSVrWH3dw4=" -> "ULv/wkFmL7kFNY+01EeFSisf6iRJ6uGVvEeSJSSADVY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "2hQc7B8chDahO1FO82rnJGdKGjJ1UIaZYlL7cSLRgLM=" -> "kq4OsyUNEK+8JopMJRRvRd2D2hORIlSKn7lYHtguTgM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZWSJlb3s50Dr+bwlc40cWaZ59aQzDyTIHBJlNbSwe/4=" -> "VmH04f8J6yAZE7GM/VgGNSEvZA0/txwvfK017vG7uvU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "DcCkhnt4oLE4F2M7KeFvd/jo6+78TTQZXiyBBdooSnY=" -> "hO4E5gVMljZXjS7CWJNp2Cs3angAI60B2Jl5l/9eXX8="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "NW1heEXbJ1OI9sWpPbvW7fFz8U//l7MLJV3jE9rHmss=" -> "6OVLKNvcwTaMt0QtC3QudRCYpbXP1KQ+0DlISe0GGnU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "k6YdB6//Bazrpepto6TekOmQlTjUhKA3V80xIdeOcgw=" -> "EMlNJwJfMKxcGghZUrkDiKZRsbQDqh0sD4Q6iGp4KE8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CJG4oaEP4lTzztQ2ee0P0AahjjSs4MGtN3HXwRiz+Mk=" -> "/6H+JTUMD1aigM1UWQ7D62QVI9+1E/BnfTRNdAUe7FA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "BodYvOnXHO8WponQvzii7V/awIKBf9a5eMkCl738HAw=" -> "qNUsXXReYil3liWC2Afuxm0Zq2F0aaC+REtZpQje1zs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "8fFHsQFtkVE3YZMVThsDIku5ISKpKe0WIDaofALWs0I=" -> "xRXJhig7H36wkb9q5zBzj8nnW9uc3I+1s13jhsgKqNM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9aNvE7Xap0zWywBDE2FhCFuAueKDN8z1/RFFO9D+ro=" -> "UF1XYv5IylLmPQNHmLox5NydMPRKynJLhZvkMZSh64g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "aotxLo1S+WGUpeI8AyvjmUIkV1ldjc6+Kh/fqWjSY8U=" -> "tVtVxzzIMV4mukX0KboFD6DJzhr8ZhCpcCqMODReb6A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "dh4axu8yUAmyi+QOo5meAF2PXYYYlvQciCNNSWWX9OU=" -> "jDAmJLfWAgPfYZ0AB35FfyTDlmF9L+K6YdC4zHhbed0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-13T05:03:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "nkvkm6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-13T05:03:44Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-13T05:03:42Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*